In [1]:
class Team:
    count = 0
    order = []
    
    def __init__(self, number, name=None, member=set()):
        self.number = number
        self.member = member
        self.name = name
        Team.count += 1
        
    def add_member(self, name):
        if name in self.member:
            print(f"{name} 님은 이미 팀에 있습니다.")
            return
        self.member.add(name)
        print(f"{name} 님을 {self.number} 팀에 추가했습니다.")
        
    def rm_member(self, name):
        if name not in self.member:
            print(f"{name} 님은 해당 팀에 없습니다.")
            return
        self.member.discard(name)
        print(f"{name} 님을 {self.number} 팀에서 삭제했습니다.")
    
    def get_count(self):
        return self.count

    def get_order(self):
        return self.order
    
    def set_order(self, number):
        while True:
            if number not in self.order:
                break
            self.order.remove(number)
        self.order.append(number)
        
    def __len__(self):
        return len(self.member)

In [2]:
t1 = Team(1)

In [3]:
t1.add_member("도강현")

도강현 님을 1 팀에 추가했습니다.

In [5]:
t1.add_member("도강현")

도강현 님은 이미 팀에 있습니다.

In [6]:
len(t1)

1

In [7]:
t1.add_member("이호진")

이호진 님을 1 팀에 추가했습니다.

In [9]:
len(t1)

2

In [10]:
t1.add_member("이기수")

이기수 님을 1 팀에 추가했습니다.

In [11]:
t1.rm_member("이기수")

이기수 님을 1 팀에서 삭제했습니다.

In [12]:
t2 = Team(2)

In [13]:
t2.set_order(t2.number)

In [14]:
t1.set_order(t1.number)

In [15]:
t1.get_order()

[2, 1]

In [16]:
t2.get_order()

[2, 1]

In [17]:
t1.get_count()

2

In [18]:
t3 = Team(3)

In [19]:
t3.get_count()

3

In [20]:
t3.set_order(t3.number)

In [21]:
t3.get_order()

[2, 1, 3]

In [22]:
import pandas as pd

In [24]:
s = pd.Series([9_904_312, 3_448_737,2_890_451, 2_466_052],
              index = ["서울", "부산", "인천", "대구"])
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [25]:
pd.Series(range(10,14))

0    10
1    11
2    12
3    13
dtype: int64

In [26]:
s.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [27]:
s.values

array([9904312, 3448737, 2890451, 2466052], dtype=int64)

In [28]:
s.name = "인구"
s.index.name = "도시"
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [29]:
d = {'a' : 1, 'b' : 2, 'c' : 3}
ser = pd.Series(data = d, index = ['a' , 'b', 'c'])
ser

a    1
b    2
c    3
dtype: int64

In [30]:
ser = pd.Series(data = d, index = ['x' , 'y', 'z'])

In [31]:
ser

x   NaN
y   NaN
z   NaN
dtype: float64

In [32]:
s2 = pd.Series({"서울" : 9904312,
                "부산" : 3448737,
                "인천" : 2890451,
                "대구" : 2466052})
s2

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [33]:
"서울" in s

True

In [34]:
"대전" in s

False

In [35]:
for k,v in s.items():
    print(f"{k}, {v}")

서울, 9904312
부산, 3448737
인천, 2890451
대구, 2466052

### Series 인덱싱  
넘파이 배열에서 가능한 index 방법 외에도 index label을 이용한 인덱싱도 할 수 있음.  
배열 인덱싱이나 index label을 이용한 슬라이싱도 가능

In [36]:
s[1], s["부산"]

(3448737, 3448737)

In [37]:
s3 = pd.Series({"서울" : 9631482, "부산" : 3393191, "인천" : 2632035, "대전" : 1490158})
s3

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

In [38]:
ds = s2 - s3

In [39]:
ds

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

### NaN(Not a Number) 라는 값은 float 자료형에서만 표현이 되기에 다른 계산도 float 자료형이 되었음을 알 수 있음.

### Series 내 값이 NaN인지 아닌지 True/ False 값을 구하려면 notnull() 메서드를 이용

In [40]:
ds.notnull()

대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool

### Series에서 NaN이 아닌 값을 구하기  
notnull() 메서드로 구한 True/False 값을 이요하여 NaN을 배제한 Series 객체를 만들 수 있음

In [41]:
ds[ds.notnull()]

부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [42]:
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [43]:
s2

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [44]:
s3

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

In [45]:
rs = (s2 - s3) / s3 * 100
rs = rs[rs.notnull()]
rs

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

### Series 데이터 추가, 갱신, 삭제  
인덱싱을 경우에 맞춰 사용하면 데이터를 추가하거나 갱신할 수 있음.  
기존에 있는 index에 값을 할당하면 갱신 없으면 추가

In [46]:
rs

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

In [47]:
rs["부산"] = 1.63

In [48]:
rs

부산    1.630000
서울    2.832690
인천    9.818107
dtype: float64

In [49]:
rs["대구"] = 1.41
rs

부산    1.630000
서울    2.832690
인천    9.818107
대구    1.410000
dtype: float64

In [50]:
del rs["서울"]

In [51]:
rs

부산    1.630000
인천    9.818107
대구    1.410000
dtype: float64

In [52]:
fin1 = {"카카오" : 60010, "삼성전자" : 61000, "LG전자" : 90000}
fin2_value = [60200,61200,200100]
fin2_index = ["카카오", "삼성전자", "네이버"]

In [53]:
ser_finance1 = pd.Series(fin1)
ser_finance2 = pd.Series(fin2_value, fin2_index)

In [54]:
print(ser_finance1)
print(ser_finance2)

카카오     60010
삼성전자    61000
LG전자    90000
dtype: int64
카카오      60200
삼성전자     61200
네이버     200100
dtype: int64

In [55]:
ser_finance1 - ser_finance2

LG전자      NaN
네이버       NaN
삼성전자   -200.0
카카오    -190.0
dtype: float64

In [56]:
ser_finance1 + ser_finance2

LG전자         NaN
네이버          NaN
삼성전자    122200.0
카카오     120210.0
dtype: float64

In [57]:
ser_finance1 * ser_finance2

LG전자             NaN
네이버              NaN
삼성전자    3.733200e+09
카카오     3.612602e+09
dtype: float64

In [58]:
ser_finance1 / ser_finance2

LG전자         NaN
네이버          NaN
삼성전자    0.996732
카카오     0.996844
dtype: float64

In [59]:
result = ser_finance1 - ser_finance2
result[result.notnull()]

삼성전자   -200.0
카카오    -190.0
dtype: float64

## DataFrame 생성  
만드는 방법은 다양  
1. 하나의 열이 되는 데이터를 리스트나 일차원 배열을 준비  
2. 이 각각의 열에 대한 이름을 키로 가지는 딕셔너리 만들기
3. 이 데이터를 DataFrame 클래스에 넣는다. 동시에 열방향 index는 columns인수로 , 햇방향 index는 index인수로 지정합니다.

In [60]:
data = {
    "2015" : [9904312, 3448737, 5890451, 2466052],
    "2010" : [9631482, 3393191,2362035, 2431774],
    "2005" : [9762546, 3512547, 2514680, 2456016],
    "2000" : [9853972, 3655437, 2466338, 2473990],
    "지역" : ["수도권", "경상권", "수도권", "경상권"],
    "2010 - 2015 증가율" : [0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000" ,"2010 - 2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index= index, columns = columns)
df

     지역     2015     2010     2005     2000  2010 - 2015 증가율
서울  수도권  9904312  9631482  9762546  9853972           0.0283
부산  경상권  3448737  3393191  3512547  3655437           0.0163
인천  수도권  5890451  2362035  2514680  2466338           0.0982
대구  경상권  2466052  2431774  2456016  2473990           0.0141

In [61]:
df.values

array([['수도권', 9904312, 9631482, 9762546, 9853972, 0.0283],
       ['경상권', 3448737, 3393191, 3512547, 3655437, 0.0163],
       ['수도권', 5890451, 2362035, 2514680, 2466338, 0.0982],
       ['경상권', 2466052, 2431774, 2456016, 2473990, 0.0141]], dtype=object)

In [62]:
df.columns

Index(['지역', '2015', '2010', '2005', '2000', '2010 - 2015 증가율'], dtype='object')

In [63]:
df.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

### DataFrame column 인덱싱  
DataFrame은 column label을 키로, column Series를 값으로 가지는 딕셔너리아 비슷.  
column label을 키로 생각하여 인덱싱이 가능.

In [64]:
df["지역"]

서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [69]:
Data = {
    "c1" : [1, 2, "누락"],
    "c2" : [1.11,str(), 3.33],
    "c3" : ["one", "two", "three"],
}
columns = ["c1", "c2", "c3"]
index = [0,1,2]
Data = pd.DataFrame(Data, index= index, columns = columns)
Data

   c1    c2     c3
0   1  1.11    one
1   2          two
2  누락  3.33  three

### Pandas 데이터 csv로 출력하기  
df_csv.to_csv("파일 이름 및 확장자" , index = False)와 같이 사용.

In [72]:
df.to_csv("sample.csv",index = False)

notebook_dir로 설정한 C:\python 경로에 생성이 될것임

In [74]:
df.to_csv("sample2.csv",index = False, encoding='UTF-8')

## 만든 csv 파일로부터 데이터를 불러오기.  
  
  read_csv() 메서드를 이용.

CSV 파일로부터 데이터를 읽어 DataFrame을 만들때는 pandas.read_csv()를 이용.  
첫번째 인수로 "파일 이름.확장자" 문자열로 넣음

In [75]:
df_read = pd.read_csv("sample2.csv")
df_read

    지역     2015     2010     2005     2000  2010 - 2015 증가율
0  수도권  9904312  9631482  9762546  9853972           0.0283
1  경상권  3448737  3393191  3512547  3655437           0.0163
2  수도권  5890451  2362035  2514680  2466338           0.0982
3  경상권  2466052  2431774  2456016  2473990           0.0141

In [76]:
Data.to_csv("sample3.csv", index=False, header=False)

In [77]:
Data.to_csv("sample4.csv", index=False)

In [79]:
pd.read_csv('sample3.csv', names=['c1', 'c2', 'c3'])

   c1    c2     c3
0   1  1.11    one
1   2   NaN    two
2  누락  3.33  three

In [80]:
%%writefile sample3.txt
c1        c2        c3        c4
0.179181 -1.538472  1.347553  0.43381
1.024209  0.087307 -1.281997  0.49265
0.417899 -2.002308  0.255245 -1.10515

Writing sample3.txt

### 텍스트파일 불러오기  
텍스트 파일을 불러오려면 데이터를 구분하는 구분자가 콤마가 아니면 sep인수를 써서 구분자를 사용자가 지정해줘야함.  
만약 길이가 정해지지 않은 공백이 구분자인 경우 \s+ (정규식)문자열을 사용하면 됨.

In [81]:
pd.read_table('sample3.txt', sep='\s+')

         c1        c2        c3       c4
0  0.179181 -1.538472  1.347553  0.43381
1  1.024209  0.087307 -1.281997  0.49265
2  0.417899 -2.002308  0.255245 -1.10515

In [82]:
%%writefile sample4.txt
파일 제목: sample4.txt
데이터 포맷의 설명:
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Writing sample4.txt

### 파일을 불러올때 부가적인 텍스트 설명이 있는 경우.

부가적인 텍스트가 있는 경우, 건너뛰어야하는 상단 행이 있다면 skiprows를 사용하면 됨.

In [83]:
pd.read_csv('sample4.txt', skiprows=[0,1])

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [84]:
pd.read_csv('sample4.txt', skiprows = range(2))

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

### 특정한 값을 NaN으로 취급하고 싶을 때  
na_values 인수에 NaN 값으로 취급할 값을 넣으면 됨.

In [86]:
df_na_val = pd.read_csv('sample4.csv', na_values=['누락'])
df_na_val

    c1    c2     c3
0  1.0  1.11    one
1  2.0   NaN    two
2  NaN  3.33  three

### 파일을 읽을 때와 마찬가지로 파일을 출력할 때도 sep 인수로 구분자를 바꿀 수 있음

In [87]:
df_na_val.to_csv('sample5.txt', sep='|')

### 온라인상 csv파일 가져오기

In [88]:
titanic = pd.read_csv("https://storage.googleapis.com/tf-datasets/titanic/train.csv")

In [89]:
titanic.head()

,survived,sex,age,n_siblings_spouses,parch,fare,class,deck,embark_town,alone
0,0,male,22.0,1,0,7.2500,Third,unknown,Southampton,n
1,1,female,38.0,1,0,71.2833,First,C,Cherbourg,n
2,1,female,26.0,0,0,7.9250,Third,unknown,Southampton,y
3,1,female,35.0,1,0,53.1000,First,C,Southampton,n
4,0,male,28.0,0,0,8.4583,Third,unknown,Queenstown,y

### 앞이나 뒤의 특정 개수만 보고 싶다면 head()나 tail()메서드를 사용하면 확인 가능

In [90]:
titanic.head(20)

,survived,sex,age,n_siblings_spouses,parch,fare,class,deck,embark_town,alone
0,0,male,22.0,1,0,7.2500,Third,unknown,Southampton,n
1,1,female,38.0,1,0,71.2833,First,C,Cherbourg,n
2,1,female,26.0,0,0,7.9250,Third,unknown,Southampton,y
3,1,female,35.0,1,0,53.1000,First,C,Southampton,n
4,0,male,28.0,0,0,8.4583,Third,unknown,Queenstown,y
5,0,male,2.0,3,1,21.0750,Third,unknown,Southampton,n
6,1,female,27.0,0,2,11.1333,Third,unknown,Southampton,n
7,1,female,14.0,1,0,30.0708,Second,unknown,Cherbourg,n
8,1,female,4.0,1,1,16.7000,Third,G,Southampton,n
9,0,male,20.0,0,0,8.0500,Third,unknown,Southampton,y
10,0,male,39.0,1,5,31.2750,Third,unknown,Southampton,n
11,0,female,14.0,0,0,7.8542,Third,unknown,Southampton,y
12,0,male,2.0,4,1,29.1250,Third,unknown,Queenstown,n
13,1,male,28.0,0,0,13.0000,Second,unknown,Southampton,y
14,0,female,31.0,1,0,18.0000,Third,unknown,Southampton,n
15,1,female,28.0,0,0,7.2250,Third,unknown,Cherbourg,y
16,0,male,35.0,0,0,26.0000,Second,unknown,Southampton,y
17,1,male,28.0,0,0,35.5000,First,A,Southampton,y
18,1,female,38.0,1,5,31.3875,Third,unknown,Southampton,n
19,0,male,28.0,0,0,7.2250,Third,unknown,Cherbourg,y

## DataFrame 고급 인덱싱  
DataFrame에서 특정 데이터만 골라내는 것을 인덱싱이라함.  
Pandas는 NumPy 배열과 같이 콤마(,)를 사용한 (row 인덱스, column 인덱스)형식의 2차원 인덱싱을 지원하기 위해 다음과 같은 특별한 인덱서(indexer)속성도 제공함.  
1. loc = label 값 기반의 2차원 인덱싱
2. iloc = 순서를 나타내는 정수 기반의 2차원 인덱싱

### loc 인덱서  
  
  df.loc[row 인덱싱 값] -> column 생략  
  df.loc[row_인덱싱 값, column 인덱싱 값]

인덱싱 값은 다음 중 하나.  
row 인덱싱 값은 정수 또는 row index 데이터  
column 인덱싱 값은 label 문자열

1. index 데이터
2. index 데이터 슬라이싱
3. index 데이터 리스트
4. 같은 row 인덱스를 가지는 boolean Series(row 인덱싱의 경우)
5. 또는 위의 값들을 반환하는 함수

In [96]:
import numpy as np

In [100]:
dt_value = np.arange(10, 22).reshape(3,4)

In [101]:
print(dt_value)

[[10 11 12 13]
 [14 15 16 17]
 [18 19 20 21]]

In [104]:
dt_index = ['A','B','C','D']
dt_row_index = ['a' , 'b', 'c']
set_data = pd.DataFrame(dt_value, columns = dt_index, index = dt_row_index)

In [105]:
print(set_data)

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [109]:
set_data.loc[["b", "c"]]

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [110]:
set_data > 15

       A      B      C      D
a  False  False  False  False
b  False  False   True   True
c   True   True   True   True

In [111]:
set_data.A >15

a    False
b    False
c     True
Name: A, dtype: bool

In [116]:
def select_rows(df, num):
    return df.A > num

select_rows(df, 10)

AttributeError: 'DataFrame' object has no attribute 'A'

### loc 인덱서는 column label 인덱싱이나 column label 리스트 인덱싱은 불가함.

### row 인덱스 값이 아래의 예제처럼 default 로 주어지는 정수로 생성된 DataFrame의 경우에는 슬라이싱 마지막 숫자가 포함된 결과를 가져옴.

In [124]:
df2 = pd.DataFrame(np.arange(10,26).reshape(4,4), columns = ["A","B","C","D"], index = ["a", "b", "c", "d"])
df2

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21
d  22  23  24  25

In [130]:
df2.loc['a':'b']

    A   B   C   D
a  10  11  12  13
b  14  15  16  17

### loc는 label을 바라보고 포함한다  
### iloc는 int index를 바라보고 불포함한다

In [131]:
df2.iloc[1:2]

    A   B   C   D
b  14  15  16  17

row와 column 모두 받으려면 df.loc[row인덱스, column 인덱스]와 같은 형태로 사용.

In [133]:
df2.loc["a", "A"]

10

In [134]:
df2.loc[df2.A>10, ["C", "D"]]

    C   D
b  16  17
c  20  21
d  24  25

### iloc -> 순서를 나타내는 정수 인덱스만 받음

In [135]:
df2.iloc[0,1]

11

In [137]:
df2.iloc[:2, 2]

a    12
b    16
Name: C, dtype: int32

In [139]:
df2.iloc[0, -2:]

C    12
D    13
Name: a, dtype: int32

In [140]:
df2.iloc[2:3, 1:3]

    B   C
c  19  20

In [141]:
df2.iloc[-1]

A    22
B    23
C    24
D    25
Name: d, dtype: int32

## Series 데이터 개수세기  
Pandas 는 numpy 2차원 배열에서 가능한 대부분의 데이터 처리가 가능함.  
또 데이터 처리 및 변환을 위한 다양한 함수와 메서드를 제공.  
가장 간단한 데이터 분석은 데이터 개수세기  
개수 셀때엔 count() 메서드를 사용, 이때 NaN은 세지 않음

In [143]:
s = pd.Series(range(10))
s[3] = np.nan
s

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [144]:
s.count()

9

In [145]:
len(s)

10

### count()메서드는 NaN을 세지 않음. 반대로 len()은 NaN을 셈

In [149]:
import random

In [150]:
np.random.seed(2)
df = pd.DataFrame(np.random.randint(5, size=(4,4)), dtype = float)
df.iloc[2,3] = np.nan
df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [151]:
df.count()

0    4
1    4
2    4
3    3
dtype: int64

## seaborn이라는 패키지 -> 여러 데이터를 제공하고 있음

In [153]:
import seaborn as sns
titanic = sns.load_dataset("titanic")
titanic.head(5)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [154]:
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

### 연습문제

In [160]:
titanic.iloc[3]

survived                 1
pclass                   1
sex                 female
age                   35.0
sibsp                    1
parch                    0
fare                  53.1
embarked                 S
class                First
who                  woman
adult_male           False
deck                     C
embark_town    Southampton
alive                  yes
alone                False
Name: 3, dtype: object

In [162]:
titanic.iloc[:,2]

0        male
1      female
2      female
3      female
4        male
        ...
886      male
887    female
888    female
889      male
890      male
Name: sex, Length: 891, dtype: object

In [190]:
print(titanic.value_counts('sex'))
print(titanic.value_counts('age', ascending=False))
print(titanic.value_counts('class', ascending=False))
print(titanic.value_counts('survived', ascending=False))
print(titanic.value_counts('alive'))

sex
male      577
female    314
dtype: int64
age
24.00    30
22.00    27
18.00    26
30.00    25
28.00    25
         ..
20.50     1
14.50     1
12.00     1
0.92      1
80.00     1
Length: 88, dtype: int64
class
Third     491
First     216
Second    184
dtype: int64
survived
0    549
1    342
dtype: int64
alive
no     549
yes    342
dtype: int64

In [188]:
titanic_sex = titanic.iloc[:,2]
print(titanic_sex.value_counts())

male      577
female    314
Name: sex, dtype: int64

In [189]:
df3 = pd.DataFrame(np.ones((3,4)), columns = list('가나다라'))
df3

     가    나    다    라
0  1.0  1.0  1.0  1.0
1  1.0  1.0  1.0  1.0
2  1.0  1.0  1.0  1.0

In [200]:
np.random.seed(1)
df2 = pd.DataFrame(np.random.randint(10, size=(4,8)))
df2

   0  1  2  3  4  5  6  7
0  5  8  9  5  0  0  1  7
1  6  9  2  4  5  2  4  2
2  4  7  7  9  1  7  0  6
3  9  9  7  6  9  1  0  1

In [201]:
df2.sum(axis=1)

0    35
1    34
2    41
3    42
dtype: int64

In [202]:
df2["RowSum"] = df2.sum(axis=1)
df2

   0  1  2  3  4  5  6  7  RowSum
0  5  8  9  5  0  0  1  7      35
1  6  9  2  4  5  2  4  2      34
2  4  7  7  9  1  7  0  6      41
3  9  9  7  6  9  1  0  1      42

In [203]:
df2.sum() #axis=0이 디폴트

0          24
1          33
2          25
3          24
4          15
5          10
6           5
7          16
RowSum    152
dtype: int64

In [204]:
df2.loc["ColTotal", :] = df2.sum()

In [205]:
df2

             0     1     2     3     4     5    6     7  RowSum
0          5.0   8.0   9.0   5.0   0.0   0.0  1.0   7.0    35.0
1          6.0   9.0   2.0   4.0   5.0   2.0  4.0   2.0    34.0
2          4.0   7.0   7.0   9.0   1.0   7.0  0.0   6.0    41.0
3          9.0   9.0   7.0   6.0   9.0   1.0  0.0   1.0    42.0
ColTotal  24.0  33.0  25.0  24.0  15.0  10.0  5.0  16.0   152.0

In [213]:
df2.loc["ColMean", :] = df2.mean()
df2

             0     1     2     3     4     5    6     7  RowSum
0          5.0   8.0   9.0   5.0   0.0   0.0  1.0   7.0    35.0
1          6.0   9.0   2.0   4.0   5.0   2.0  4.0   2.0    34.0
2          4.0   7.0   7.0   9.0   1.0   7.0  0.0   6.0    41.0
3          9.0   9.0   7.0   6.0   9.0   1.0  0.0   1.0    42.0
ColTotal  24.0  33.0  25.0  24.0  15.0  10.0  5.0  16.0   152.0
ColMean    9.6  13.2  10.0   9.6   6.0   4.0  2.0   6.4    60.8

In [256]:
titanic['age'].mean()

29.69911764705882

In [257]:
print(titanic_sex)

     survived  pclass     sex   age  sibsp  parch      fare embarked  class  \
383         1       1  female  35.0      1      0   52.0000        S  First
218         1       1  female  32.0      0      0   76.2917        C  First
609         1       1  female  40.0      0      0  153.4625        S  First
216         1       3  female  27.0      0      0    7.9250        S  Third
215         1       1  female  31.0      1      0  113.2750        C  First
..        ...     ...     ...   ...    ...    ...       ...      ...    ...
371         0       3    male  18.0      1      0    6.4958        S  Third
372         0       3    male  19.0      0      0    8.0500        S  Third
373         0       1    male  22.0      0      0  135.6333        C  First
360         0       3    male  40.0      1      4   27.9000        S  Third
890         0       3    male  32.0      0      0    7.7500        Q  Third

       who  adult_male deck  embark_town alive  alone
383  woman       False  NaN  Southampton   yes  False
218  woman       False    D    Cherbourg   yes   True
609  woman       False    C  Southampton   yes   True
216  woman       False  NaN  Southampton   yes   True
215  woman       False    D    Cherbourg   yes  False
..     ...         ...  ...          ...   ...    ...
371    man        True  NaN  Southampton    no  False
372    man        True  NaN  Southampton    no   True
373    man        True  NaN    Cherbourg    no   True
360    man        True  NaN  Southampton    no  False
890    man        True  NaN   Queenstown    no   True

[891 rows x 15 columns]

In [258]:
titanic.head(5)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [227]:
print(titanic.sort_values('sex'))

     survived  pclass     sex   age  sibsp  parch      fare embarked  class  \
383         1       1  female  35.0      1      0   52.0000        S  First
218         1       1  female  32.0      0      0   76.2917        C  First
609         1       1  female  40.0      0      0  153.4625        S  First
216         1       3  female  27.0      0      0    7.9250        S  Third
215         1       1  female  31.0      1      0  113.2750        C  First
..        ...     ...     ...   ...    ...    ...       ...      ...    ...
371         0       3    male  18.0      1      0    6.4958        S  Third
372         0       3    male  19.0      0      0    8.0500        S  Third
373         0       1    male  22.0      0      0  135.6333        C  First
360         0       3    male  40.0      1      4   27.9000        S  Third
890         0       3    male  32.0      0      0    7.7500        Q  Third

       who  adult_male deck  embark_town alive  alone
383  woman       False  NaN  Southampton   yes  False
218  woman       False    D    Cherbourg   yes   True
609  woman       False    C  Southampton   yes   True
216  woman       False  NaN  Southampton   yes   True
215  woman       False    D    Cherbourg   yes  False
..     ...         ...  ...          ...   ...    ...
371    man        True  NaN  Southampton    no  False
372    man        True  NaN  Southampton    no   True
373    man        True  NaN    Cherbourg    no   True
360    man        True  NaN  Southampton    no  False
890    man        True  NaN   Queenstown    no   True

[891 rows x 15 columns]

In [247]:
titanic_sex = titanic.sort_values('sex')
print(titanic_sex)

     survived  pclass     sex   age  sibsp  parch      fare embarked  class  \
383         1       1  female  35.0      1      0   52.0000        S  First
218         1       1  female  32.0      0      0   76.2917        C  First
609         1       1  female  40.0      0      0  153.4625        S  First
216         1       3  female  27.0      0      0    7.9250        S  Third
215         1       1  female  31.0      1      0  113.2750        C  First
..        ...     ...     ...   ...    ...    ...       ...      ...    ...
371         0       3    male  18.0      1      0    6.4958        S  Third
372         0       3    male  19.0      0      0    8.0500        S  Third
373         0       1    male  22.0      0      0  135.6333        C  First
360         0       3    male  40.0      1      4   27.9000        S  Third
890         0       3    male  32.0      0      0    7.7500        Q  Third

       who  adult_male deck  embark_town alive  alone
383  woman       False  NaN  Southampton   yes  False
218  woman       False    D    Cherbourg   yes   True
609  woman       False    C  Southampton   yes   True
216  woman       False  NaN  Southampton   yes   True
215  woman       False    D    Cherbourg   yes  False
..     ...         ...  ...          ...   ...    ...
371    man        True  NaN  Southampton    no  False
372    man        True  NaN  Southampton    no   True
373    man        True  NaN    Cherbourg    no   True
360    man        True  NaN  Southampton    no  False
890    man        True  NaN   Queenstown    no   True

[891 rows x 15 columns]

In [280]:
titanic_female = titanic[(titanic['sex'] == 'female')]
round(titanic['age'][titanic.sex == 'female'].mean(),1)

27.9

In [278]:
round(titanic['age'][(titanic.sex == 'female') & (titanic.pclass == 1)].mean(),1)

34.6

In [251]:
titanic_female['age'].mean()

27.915708812260537

In [252]:
titanic_fem_pclass = titanic_female[(titanic_female['pclass'] == 1)]
titanic_fem_pclass

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
31,1,1,female,NaN,1,0,146.5208,C,First,woman,False,B,Cherbourg,yes,False
52,1,1,female,49.0,1,0,76.7292,C,First,woman,False,D,Cherbourg,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
856,1,1,female,45.0,1,1,164.8667,S,First,woman,False,NaN,Southampton,yes,False
862,1,1,female,48.0,0,0,25.9292,S,First,woman,False,D,Southampton,yes,True
871,1,1,female,47.0,1,1,52.5542,S,First,woman,False,D,Southampton,yes,False
879,1,1,female,56.0,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True

In [253]:
titanic_fem_pclass['age'].mean()

34.61176470588235

In [282]:
df3 = pd.DataFrame({
    'A' : [1,3,4,3,4],
    'B' : [2,3,1,2,3],
    'C' : [1,5,2,4,4]
})
df3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4